# Дочепо се мали брата очевога сата. Пошто је још мали, зна да гледа само сатну казаљку. Сат се може навијати
# тако што се једним дугметом сатна казаљка помера за један сат унапред (у смеру кретаља казаљке на сату)
# а другим дугметом се помера за један сат уназад (у супротном смеру кретања казаљке на сату). Ако се зна
# позиција a на којој се тренутно налази казаљка, позиција b на којој брата жели да се нађе, напиши програм
# који одређује да ли се сат може навити тако што брата притисне једно од два дугмета тачно k пута.
#
# Улаз: Са стандардног улаза учитавају се бројеви 0 ≤ a, b ≤ 11 и број 0 ≤ k ≤ 1000.
#
# Излаз: На стандардни излаз написати текст napred ако се сат може навити тако што се казаљка помера
# унапред, nazad ако се сат може навити тако што се казаљка помера уназад (ако је сат могуће навити на оба
# начина, исписати napred, а затим nazad у следећем реду) тј. ne moze ако се сат не може навити.
#
# Пример 1
# Улаз
# 1
# 7
# 18
# Излаз
# napred
# nazad
#
# Пример 2
# Улаз
# 2
# 4
# 10
# Излаз
# nazad
#
# Пример 3
# Улаз
# 7
# 9
# 3
# Излаз
# ne moze

a = int(input("Unesi pocetni sat: "))
b = int(input("Unsei zavrsni sat: "))
k = int(input("Unesi broj pritisaka dugmeta za pomeranje kazaljek u zeljenom smeru: "))

if abs(b-a) == k%12   or (12-a+b) == k%12 or (12-b+a) == k%12:
    if ((b>a) and (b-a) == k % 12)    or ((a>b) and (12-a+b) == k % 12) :
        print("napred")
    if ((b>a) and (12-b+a) == k % 12) or ((a>b)  and (a-b) == k % 12) :
        print("nazad")
else:
    print("ne moze")
