# Претпоставимо да приликом исказивања времена за сате користимо само бројеве од 1 до 12. Тако за 17:45
# кажемо 5:45, а за 0:32 кажемо да је 12:32. Ако је познат број сати и минута такав да је број сати у опсегу од
# 0 до 23, а минута од 0 до 59, исказати то време тако да је број сати у опсегу 1 до 12.
#
# Улаз: Учитавају се два броја, сваки у посебној линији. У првој линији је број сати (између 0 и 23), а у другој
# линији је број минута (између 0 и 59).
#
# Излаз: Исписује се једна линија у којој се приказује временски тренутак у формату h:m, где је број сати h
# између 1 и 12, а број минута између 0 и 59.
#
# Пример 1
# Улаз
# 0
# 32
# Излаз
# 12:32
#
# Пример 2
# Улаз
# 5
# 35
# Излаз
# 5:35

h = int(input("Unesi sate: "))
m = int(input("Unesi minute: "))
print((h + 11) % 12 + 1, ":", m, sep='')
